<a href="https://colab.research.google.com/github/saiyanka/block/blob/master/wk1somaliachallenge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
pip install mysql

Collecting mysql
  Downloading mysql-0.0.3-py3-none-any.whl (1.2 kB)
Collecting mysqlclient (from mysql)
  Downloading mysqlclient-2.2.4.tar.gz (90 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 90.4/90.4 kB 2.8 MB/s eta 0:00:00
  Installing build dependencies ... done
  Getting requirements to build wheel ... done
  Installing backend dependencies ... done
  Preparing metadata (pyproject.toml) ... done
Building wheels for collected packages: mysqlclient
  Building wheel for mysqlclient (pyproject.toml) ... done
  Created wheel for mysqlclient: filename=mysqlclient-2.2.4-cp310-cp310-linux_x86_64.whl size=124734 sha256=a63186bda8dcc41c677cffb60459ec61058ee887353ba388714954774885ced9
  Stored in directory: /root/.cache/pip/wheels/ac/96/ac/2a4d8cb58a4d95de1dffc3f8b0ea42e0e5b63ab97640edbda3
Successfully built mysqlclient
Installing collected packages: mysqlclient, mysql
Successfully installed mysql-0.0.3 mysqlclient-2.2.4

In [2]:
%load_ext sql

In [5]:
%sql sqlite:///ABC_DATA.db

In [6]:
%%sql CREATE TABLE customers(
  customer_id integer PRIMARY KEY,
  first_name varchar(30),
  last_name varchar(30),
  email varchar(500)

);

 * sqlite:///ABC_DATA.db
Done.

[]

In [7]:
%%sql CREATE TABLE products(
  product_id integer PRIMARY KEY,
  product_name varchar(30),
  price integer

);

 * sqlite:///ABC_DATA.db
Done.

[]

In [10]:
%%sql CREATE TABLE orders(
    order_id integer PRIMARY KEY,
    customer_id ,
    order_date DATE
);

 * sqlite:///ABC_DATA.db
Done.

[]

In [11]:
%%sql CREATE TABLE order_items(
    order_id PRIMARY KEY,
    product_id integer,
    quantity integer
);

 * sqlite:///ABC_DATA.db
Done.

[]

In [12]:
%sql select * FROM customers

 * sqlite:///ABC_DATA.db
Done.

[]

In [19]:
%%sql INSERT INTO customers (customer_id, first_name, last_name, email) VALUES
(1, 'John', 'Doe', 'johndoe@email.com'),
(2, 'Jane', 'Smith', 'janesmith@email.com'),
(3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
(4, 'Alice', 'Brown', 'alicebrown@email.com'),
(5, 'Charlie', 'Davis', 'charliedavis@email.com'),
(6, 'Eva', 'Fisher', 'evafisher@email.com'),
(7, 'George', 'Harris', 'georgeharris@email.com'),
(8, 'Ivy', 'Jones', 'ivyjones@email.com'),
(9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
(10, 'Lily', 'Nelson', 'lilynelson@email.com'),
(11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
(12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
(13, 'Sophia', 'Thomas', 'sophiathomas@email.com');

 * sqlite:///ABC_DATA.db
13 rows affected.

[]

In [20]:
%%sql SELECT * FROM customers;

 * sqlite:///ABC_DATA.db
Done.

[(1, 'John', 'Doe', 'johndoe@email.com'),
 (2, 'Jane', 'Smith', 'janesmith@email.com'),
 (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
 (4, 'Alice', 'Brown', 'alicebrown@email.com'),
 (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
 (6, 'Eva', 'Fisher', 'evafisher@email.com'),
 (7, 'George', 'Harris', 'georgeharris@email.com'),
 (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
 (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
 (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
 (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
 (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
 (13, 'Sophia', 'Thomas', 'sophiathomas@email.com')]

In [ ]:

%sql select * FROM customers

 * sqlite:///ABC_DATA.db
Done.

[]

In [21]:
%%sql  INSERT INTO products (product_id, product_name, price) VALUES
    (1, 'Product A', 10.00),
    (2, 'Product B', 15.00),
    (3, 'Product C', 20.00),
    (4, 'Product D', 25.00),
    (5, 'Product E', 30.00),
    (6, 'Product F', 35.00),
    (7, 'Product G', 40.00),
    (8, 'Product H', 45.00),
    (9, 'Product I', 50.00),
    (10, 'Product J', 55.00),
    (11, 'Product K', 60.00),
    (12, 'Product L', 65.00),
    (13, 'Product M', 70.00);

 * sqlite:///ABC_DATA.db
13 rows affected.

[]

In [22]:
 %%sql INSERT INTO orders (order_id, customer_id, order_date) VALUES
    (1, 1, '2023-05-01'),
    (2, 2, '2023-05-02'),
    (3, 3, '2023-05-03'),
    (4, 1, '2023-05-04'),
    (5, 2, '2023-05-05'),
    (6, 3, '2023-05-06'),
    (7, 4, '2023-05-07'),
    (8, 5, '2023-05-08'),
    (9, 6, '2023-05-09'),
    (10, 7, '2023-05-10'),
    (11, 8, '2023-05-11'),
    (12, 9, '2023-05-12'),
    (13, 10, '2023-05-13'),
    (14, 11, '2023-05-14'),
    (15, 12, '2023-05-15'),
    (16, 13, '2023-05-16');

 * sqlite:///ABC_DATA.db
16 rows affected.

[]

In [26]:
%%sql INSERT OR IGNORE INTO order_items (order_id, product_id, quantity) VALUES
    (1, 1, 2),
    (1, 2, 1),
    (2, 2, 1),
    (2, 3, 3),
    (3, 1, 1),
    (3, 3, 2),
    (4, 2, 4),
    (4, 3, 1),
    (5, 1, 1),
    (5, 3, 2),
    (6, 2, 3),
    (6, 1, 1),
    (7, 4, 1),
    (7, 5, 2),
    (8, 6, 3),
    (8, 7, 1),
    (9, 8, 2),
    (9, 9, 1),
    (10, 10, 3),
    (10, 11, 2),
    (11, 12, 1),
    (11, 13, 3),
    (12, 4, 2),
    (12, 5, 1),
    (13, 6, 3),
    (13, 7, 2),
    (14, 8, 1),
    (14, 9, 2),
    (15, 10, 3),
    (15, 11, 1),
    (16, 12, 2),
    (16, 13, 3);

 * sqlite:///ABC_DATA.db
16 rows affected.

[]

In [27]:
%sql sqlite:///somalia.db

In [28]:
%%sql CREATE TABLE beneficiary_partner_data (
partner_id INTEGER NOT NULL PRIMARY KEY,
partner VARCHAR(30) NOT NULL,
village VARCHAR(30) NOT NULL,
beneficiaries INTEGER,
beneficiary_type VARCHAR(30)
);

   sqlite:///ABC_DATA.db
 * sqlite:///somalia.db
Done.

[]

In [29]:
%%sql CREATE TABLE village_locations (
    village_id INTEGER NOT NULL PRIMARY KEY,
    village VARCHAR(30) NOT NULL,
    latitude VARCHAR(30),
    longitude VARCHAR(30),
    total_population INTEGER
);

   sqlite:///ABC_DATA.db
 * sqlite:///somalia.db
Done.

[]

In [33]:
%%sql CREATE TABLE jurisdiction_hierachy (
    jurisdiction_id INTEGER NOT NULL PRIMARY KEY,
    Village VARCHAR(30),
    District VARCHAR(30),
    Region VARCHAR(30)

);

   sqlite:///ABC_DATA.db
 * sqlite:///somalia.db
(sqlite3.OperationalError) table jurisdiction_hierachy already exists
[SQL: CREATE TABLE jurisdiction_hierachy (
    jurisdiction_id INTEGER NOT NULL PRIMARY KEY,
    Village VARCHAR(30),
    District VARCHAR(30),
    Region VARCHAR(30)

);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [35]:
%%sql CREATE TABLE jurisdiction_hierarchy (
    jurisdiction_id INTEGER NOT NULL PRIMARY KEY,
    Village VARCHAR(30),
    District VARCHAR(30),
    Region VARCHAR(30)

);

   sqlite:///ABC_DATA.db
 * sqlite:///somalia.db
Done.

[]

In [36]:
%%sql INSERT INTO jurisdiction_hierarchy VALUES(1,'Middle Shabelle','Region',NULL);
INSERT INTO jurisdiction_hierarchy VALUES(2,'Hiraan','Region',NULL);
INSERT INTO jurisdiction_hierarchy VALUES(3,'Balcad','District','Middle Shabelle');
INSERT INTO jurisdiction_hierarchy VALUES(4,'Jowhar','District','Middle Shabelle');
INSERT INTO jurisdiction_hierarchy VALUES(5,'Beledweyn','District','Hiraan');
INSERT INTO jurisdiction_hierarchy VALUES(6,'Dharkenley','Village','Beledweyn');
INSERT INTO jurisdiction_hierarchy VALUES(7,'Bulo-Kahin','Village','Beledweyn');
INSERT INTO jurisdiction_hierarchy VALUES(8,'Hilo Kelyo','Village','Beledweyn');
INSERT INTO jurisdiction_hierarchy VALUES(9,'Xubow','Village','Beledweyn');
INSERT INTO jurisdiction_hierarchy VALUES(10,'Xiintooy','Village','Beledweyn');
INSERT INTO jurisdiction_hierarchy VALUES(11,'Dhagax Jebis','Village','Beledweyn');
INSERT INTO jurisdiction_hierarchy VALUES(12,'Filtare','Village','Beledweyn');
INSERT INTO jurisdiction_hierarchy VALUES(13,'Howl-Wadaag','Village','Beledweyn');
INSERT INTO jurisdiction_hierarchy VALUES(14,'Balcad','Village','Balcad');
INSERT INTO jurisdiction_hierarchy VALUES(15,'Mareeray','Village','Balcad');
INSERT INTO jurisdiction_hierarchy VALUES(16,'Kulmis','Village','Balcad');
INSERT INTO jurisdiction_hierarchy VALUES(17,'Sabuun','Village','Jowhar');
INSERT INTO jurisdiction_hierarchy VALUES(18,'Bayaxaw','Village','Jowhar');

   sqlite:///ABC_DATA.db
 * sqlite:///somalia.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [37]:
%%sql INSERT INTO village_locations(village_id, village,latitude,longitude, total_population) VALUES(1,'Dharkenley','4°47''35.40"','45°12''28.80"',12800);
INSERT INTO village_locations(village_id, village,latitude,longitude, total_population) VALUES(2,'Bulo-Kahin','4°47''57.00"','45°11''5.70"',9485);
INSERT INTO village_locations(village_id, village,latitude,longitude, total_population) VALUES(3,'Hilo Kelyo','4°47''57.00"','45°12''58.60"',5212);
INSERT INTO village_locations(village_id, village,latitude,longitude, total_population) VALUES(4,'Xubow','4°46''46.77"','45°12''7.57"',2558);
INSERT INTO village_locations(village_id, village,latitude,longitude, total_population) VALUES(5,'Xiintooy','4°44''14.40"','45°13''5.00"',3850);
INSERT INTO village_locations(village_id, village,latitude,longitude, total_population) VALUES(6,'Dhagax Jebis','4°44''27.86"','45°12''42.03"',3563);
INSERT INTO village_locations(village_id, village,latitude,longitude, total_population) VALUES(7,'Filtare','4°44''20.43"','45°12''27.89"',8000);
INSERT INTO village_locations(village_id, village,latitude,longitude, total_population) VALUES(8,'Howl-Wadaag','4°43''50.00"','45°11''58.20"',7525);
INSERT INTO village_locations(village_id, village,latitude,longitude, total_population) VALUES(9,'Balcad','2°21.624''','45°23.928''',1500);
INSERT INTO village_locations(village_id, village,latitude,longitude, total_population) VALUES(10,'Mareeray','2°23.504''','45°25.200''',7500);
INSERT INTO village_locations(village_id, village,latitude,longitude, total_population) VALUES(11,'Kulmis','2°36.761''','45°30.642''',6058);
INSERT INTO village_locations(village_id, village,latitude,longitude, total_population) VALUES(12,'Sabuun','2°53.020''','45°32.356''',5483);
INSERT INTO village_locations(village_id, village,latitude,longitude, total_population) VALUES(13,'Bayaxaw','2°44.768''','45°29.727''',3000);
INSERT INTO village_locations(village_id, village,latitude,longitude, total_population) VALUES(14,'Bayaxawo','2°44.768''','45°29.926''',7560);

   sqlite:///ABC_DATA.db
 * sqlite:///somalia.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [38]:
%%sql INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(1,'IRC','Balcad','1450','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(2,'NRC','Balcad','50','Households');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(3,'SCI','Balcad','1123','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(4,'IMC','Balcad','1245','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(5,'SCI','Mareeray','5200','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(6,'IMC','Mareeray','70','Households');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(7,'IRC','Mareeray','2100','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(8,'CESVI','Mareeray','1800','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(9,'SCI','Kulmis','1340','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(10,'IMC','Kulmis','55','Households');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(11,'SCI','Kulmis','4500','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(12,'IMC','Kulmis','1670','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(13,'IMC','Sabuun','1340','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(14,'IRC','Sabuun','66','Households');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(15,'CESVI','Sabuun','4090','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(16,'SCI','Sabuun','2930','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(17,'IMC','Bayaxaw','2800','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(18,'IRC','Bayaxaw','2100','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(19,'CESVI','Bayaxaw','45','Households');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(20,'SCI','Bayaxaw','1700','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(21,'SCI','Bayaxawo','5900','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(22,'IMC','Bayaxawo','40','Households');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(23,'IRC','Bayaxawo','1500','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(24,'CESVI','Bayaxawo','1260','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(25,'CESVI','Dharkenley','7880','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(26,'IRC','Dharkenley','34','Households');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(27,'SCI','Bulo-Kahin','4300','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(28,'IMC','Bulo-Kahin','4212','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(29,'IRC','Bulo-Kahin','3200','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(30,'IRC','Hilo Kelyo','5212','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(31,'SCI','Hilo Kelyo','25','Households');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(32,'CESVI','Xubow','2157','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(33,'IMC','Xiintooy','1667','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(34,'IRC','Xiintooy','2667','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(35,'CESVI','Dhagax Jebis','2856','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(36,'CESVI','Filtare','7519','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(37,'CESVI','Howl-Wadaag','6870','Individuals');
INSERT INTO beneficiary_partner_data(partner_id,partner,village,beneficiaries,beneficiary_type) VALUES(38,'IMC','Howl-Wadaag','32','Households');

   sqlite:///ABC_DATA.db
 * sqlite:///somalia.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [40]:
%%sql SELECT * FROM jurisdiction_hierarchy

   sqlite:///ABC_DATA.db
 * sqlite:///somalia.db
Done.

[(1, 'Middle Shabelle', 'Region', None),
 (2, 'Hiraan', 'Region', None),
 (3, 'Balcad', 'District', 'Middle Shabelle'),
 (4, 'Jowhar', 'District', 'Middle Shabelle'),
 (5, 'Beledweyn', 'District', 'Hiraan'),
 (6, 'Dharkenley', 'Village', 'Beledweyn'),
 (7, 'Bulo-Kahin', 'Village', 'Beledweyn'),
 (8, 'Hilo Kelyo', 'Village', 'Beledweyn'),
 (9, 'Xubow', 'Village', 'Beledweyn'),
 (10, 'Xiintooy', 'Village', 'Beledweyn'),
 (11, 'Dhagax Jebis', 'Village', 'Beledweyn'),
 (12, 'Filtare', 'Village', 'Beledweyn'),
 (13, 'Howl-Wadaag', 'Village', 'Beledweyn'),
 (14, 'Balcad', 'Village', 'Balcad'),
 (15, 'Mareeray', 'Village', 'Balcad'),
 (16, 'Kulmis', 'Village', 'Balcad'),
 (17, 'Sabuun', 'Village', 'Jowhar'),
 (18, 'Bayaxaw', 'Village', 'Jowhar')]

In [41]:
%%sql SELECT district from jurisdiction_hierarchy

   sqlite:///ABC_DATA.db
 * sqlite:///somalia.db
Done.

[('Region',),
 ('Region',),
 ('District',),
 ('District',),
 ('District',),
 ('Village',),
 ('Village',),
 ('Village',),
 ('Village',),
 ('Village',),
 ('Village',),
 ('Village',),
 ('Village',),
 ('Village',),
 ('Village',),
 ('Village',),
 ('Village',),
 ('Village',)]

In [42]:
%%sql SELECT region from jurisdiction_hierarchy

   sqlite:///ABC_DATA.db
 * sqlite:///somalia.db
Done.

[(None,),
 (None,),
 ('Middle Shabelle',),
 ('Middle Shabelle',),
 ('Hiraan',),
 ('Beledweyn',),
 ('Beledweyn',),
 ('Beledweyn',),
 ('Beledweyn',),
 ('Beledweyn',),
 ('Beledweyn',),
 ('Beledweyn',),
 ('Beledweyn',),
 ('Balcad',),
 ('Balcad',),
 ('Balcad',),
 ('Jowhar',),
 ('Jowhar',)]

In [43]:
%%sql SELECT beneficiaries from beneficiary_partner_data

   sqlite:///ABC_DATA.db
 * sqlite:///somalia.db
Done.

[(1450,),
 (50,),
 (1123,),
 (1245,),
 (5200,),
 (70,),
 (2100,),
 (1800,),
 (1340,),
 (55,),
 (4500,),
 (1670,),
 (1340,),
 (66,),
 (4090,),
 (2930,),
 (2800,),
 (2100,),
 (45,),
 (1700,),
 (5900,),
 (40,),
 (1500,),
 (1260,),
 (7880,),
 (34,),
 (4300,),
 (4212,),
 (3200,),
 (5212,),
 (25,),
 (2157,),
 (1667,),
 (2667,),
 (2856,),
 (7519,),
 (6870,),
 (32,)]

In [1]:
%%sql SELECT * FROM jurisdisction_heirarchy

UsageError: Cell magic `%%sql` not found.

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///somalia.db

In [5]:
%%sql SELECT * FROM beneficiary_partner_data

 * sqlite:///somalia.db
(sqlite3.OperationalError) no such table: beneficiary_partner_data
[SQL: SELECT * FROM beneficiary_partner_data]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [6]:
%sql sqlite:///somalia(1).db

In [7]:
%%sql SELECT * FROM jurisdisction_heirarchy

 * sqlite:///somalia(1).db
   sqlite:///somalia.db
(sqlite3.OperationalError) no such table: jurisdisction_heirarchy
[SQL: SELECT * FROM jurisdisction_heirarchy]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [8]:
%sql sqlite:///ABC_DATA(2).db

In [9]:
%%sql SELECT * FROM jurisdisction_heirarchy

 * sqlite:///ABC_DATA(2).db
   sqlite:///somalia(1).db
   sqlite:///somalia.db
(sqlite3.OperationalError) no such table: jurisdisction_heirarchy
[SQL: SELECT * FROM jurisdisction_heirarchy]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [11]:
%%sql SELECT * FROM CUSTOMERS

 * sqlite:///ABC_DATA(2).db
   sqlite:///somalia(1).db
   sqlite:///somalia.db
(sqlite3.OperationalError) no such table: CUSTOMERS
[SQL: SELECT * FROM CUSTOMERS]
(Background on this error at: https://sqlalche.me/e/20/e3q8)